[
  {
    "type": "human",
    "human": "what is jecrcuniversity ?"
  },
  {
    "type": "ai",
    "ai": "Based on the provided context, JECRC University is an educational institution that is proud of its graduates' commitment to the pursuit of knowledge, research, and societal advancement."
  },
  {
    "type": "human",
    "human": "what is jecrcuniversity ?"
  },
  {
    "type": "ai",
    "ai": "JECRC University is an institution that honors its graduates' commitment to knowledge, research, and societal advancement, and remains proud of them as they embark on their journey towards success."
  },
  {
    "type": "human",
    "human": "what is jecrcuniversity ?"
  },
  {
    "type": "ai",
    "ai": "JECRC University is a proud alma mater that honors its graduates' commitment to knowledge, research, and societal advancement, always ready to support them as they pursue their paths to success."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well?"
  },
  {
    "type": "ai",
    "ai": "Yes, according to the provided context, CollegeDekho offers BCA courses, specifically:\n\n* BCA MERN Full Stack (3 years)\n* BCA Robotic Process Automation\n* BCA Digital Forensics & Information Security\n* BCA Game Development\n\nPlease note that the eligibility criteria for BCA courses is a minimum of 60% marks in 10+2 examination from CBSE or equivalent with pass in English."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well?"
  },
  {
    "type": "ai",
    "ai": "Yes, the provided context suggests that the institution offers a BCA (Bachelor of Computer Applications) course. Specifically, it mentions three specializations under the BCA program: MERN Full Stack, Robotic Process Automation, Digital Forensics & Information Security, and Game Development. The course duration for these specializations is 3 years, and the eligibility criteria require a minimum of 60% marks in 10+2 examination from CBSE or equivalent with a pass in English."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well?"
  },
  {
    "type": "ai",
    "ai": "Yes, according to the provided information, CollegeDekho offers BCA courses as well. Specifically, they offer BCA MERN Full Stack, BCA Robotic Process Automation, BCA Digital Forensics & Information Security, and BCA Game Development, which are all 3-year programs. Additionally, the eligibility criteria for these courses require a minimum of 60% marks in 10+2 examination from CBSE or equivalent with pass in English."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in jecrc?"
  },
  {
    "type": "ai",
    "ai": "Based on the provided context, it appears that JECRC offers a Bachelor of Computer Applications (BCA) course. The course details provided on page 48 of the JECRC brochure 2025 include tuition fees, other fees, total fees, and scholarship information. The course is offered in three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations, each with a duration of three years.\n\nThe tuition fees for the BCA course range from ₹102,500 to ₹102,500 per year, with other fees ranging from ₹4,750 to ₹6,750 per year. The total fees for the course range from ₹150,000 to ₹170,000 per year. The scholarship percentage on tuition fees ranges from 15% to 20%, and the scholarship amount ranges from ₹15,375 to ₹20,500 per year.\n\nIt is clear that JECRC does offer the BCA course, and the provided context provides detailed information about the course fees and scholarship options."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, the JECRC brochure for 2025 indicates that they offer a Bachelor of Computer Applications (BCA) course. The course details provided on page 48 of the brochure show that the BCA program is offered with three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. The course duration is 3 years, and the tuition fee ranges from ₹102,500 to ₹170,000 per annum, depending on the specialization. The brochure also mentions that the college offers scholarships to students, with a percentage of the tuition fee being waived off based on the student's performance in their 12th standard exams."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in jecrc?"
  },
  {
    "type": "ai",
    "ai": "Based on the provided context, it appears that JECRC offers the BCA (Bachelor of Computer Applications) course. The brochure mentions the course details, including tuition fees, other fees, and scholarship information. The course duration is also specified to be 3 years. It seems that JECRC provides various specializations within the BCA course, including BCA-AIDS/HI and BCA: Industry Specializations."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, JECRC offers the BCA (Bachelor of Computer Applications) course. According to the provided information, the course duration is 3 years, and it has three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. The tuition fees, other fees, and total fees for each specialization are listed on the brochure. The scholarship details are also provided, including the percentage of scholarship on tuition fees and the duration of the scholarship."
  }
]