[
  {
    "type": "human",
    "human": "hi"
  },
  {
    "type": "ai",
    "ai": "Hi! It's great to connect with you! I see you're interested in an event about bridging the gap between students and the academic world. What caught your attention about Mr. Ankur Warikoo's inspiring address? Was there a particular aspect of his message that resonated with you?"
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well?"
  },
  {
    "type": "ai",
    "ai": "Yes, according to the provided context, CollegeDekho offers BCA courses, specifically:\n\n* BCA MERN Full Stack (3 years)\n* BCA Robotic Process Automation\n* BCA Digital Forensics & Information Security\n* BCA Game Development\n\nPlease let me know if you have any further questions!"
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well?"
  },
  {
    "type": "ai",
    "ai": "Yes, according to the provided context, CollegeDekho offers BCA courses, specifically:\n\n* BCA MERN Full Stack (3 years)\n* BCA Robotic Process Automation\n* BCA Digital Forensics & Information Security\n* BCA Game Development\n\nPlease let me know if you have any further questions or if there's anything else I can help you with!"
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "According to the provided context, JECRC offers the BCA (Bachelor of Computer Applications) course with different specializations, such as BCA, BCA-AIDS/HI, and BCA: Industry Specializations."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, the JECRC brochure 2025 page 48 mentions the BCA (Bachelor of Computer Applications) course. According to the table, the BCA course has three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. The course duration is 3 years, and the tuition fees vary depending on the specialization. The fees range from ₹102500 to ₹170000 per year, with an additional admission and alumni fee of ₹10000. The scholarship percentage on tuition fee is also mentioned, ranging from 15% to 20%. The scholarship amount is calculated based on the percentage from and to in the 12th grade.\n\nIt's worth noting that the brochure also mentions the B.Des.- Interior/Jewellery Design and Bachelor of Visual Arts-Graphic/Painting courses, which are not related to the BCA course."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, according to the provided information, JECRC offers the BCA (Bachelor of Computer Applications) course. The course is listed under the \"Courses\" section on page 48 of the JECRC brochure 2025, with three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. The course duration is 3 years, and the tuition fees, other fees, and scholarship details are also provided."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "Based on the provided context, it appears that JECRC offers a Bachelor of Computer Applications (BCA) course. The brochure mentions three variants of the BCA course: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. Each variant has different tuition fees, other fees, and scholarship percentages. The course duration for all three variants is three years.\n\nThe brochure also provides information on the installment structure, including the first and second installments, as well as the annual fee and admission and alumni fee. The scholarship percentages vary depending on the variant, ranging from 15% to 20% of the tuition fee.\n\nIn summary, yes, JECRC does offer the BCA course, with multiple variants and different fee structures."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, according to the provided context, JECRC University offers the Bachelor of Computer Applications (BCA) course. The course has three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. The tuition fee for each specialization varies, ranging from ₹102500 to ₹170000 per year, with other fees and scholarship options available. The duration of the course is three years."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, JECRC University offers the Bachelor of Computer Applications (BCA) course. According to the provided brochure, the BCA course is available in three specializations: BCA, BCA-AIDS/HI, and BCA: Industry Specializations. The course duration for all three specializations is three years. The tuition fee, other fees, and total fees for each specialization are also mentioned in the brochure."
  },
  {
    "type": "human",
    "human": "hi"
  },
  {
    "type": "ai",
    "ai": "Hi! It's great to connect with you. I see that you're interested in learning more about a recent event that brought together students and the academic world. I'd be happy to help you with any questions or topics you'd like to discuss. What would you like to know about the event or its speakers?"
  },
  {
    "type": "human",
    "human": "I would like to know the courses run in your college"
  },
  {
    "type": "ai",
    "ai": "I'd be happy to help you with that! The B.Tech. First Year (Semester I & II) courses are designed to provide a solid foundation in engineering principles and practices. The common courses for all B.Tech. programs at our college include:\n\n* Mathematics: Calculus, Linear Algebra, and Differential Equations\n* Physics: Mechanics, Thermodynamics, and Electromagnetism\n* Chemistry: Organic Chemistry, Inorganic Chemistry, and Physical Chemistry\n* Programming Languages: C, C++, and Python\n* Engineering Graphics: Introduction to Computer-Aided Design (CAD) and Engineering Drawing\n* Engineering Mechanics: Statics and Dynamics\n* Electrical Circuits: Fundamentals of Electrical Engineering and Circuit Analysis\n* Computer Science: Introduction to Computer Systems, Data Structures, and Algorithms\n\nThese courses are designed to provide a broad-based education in engineering, with a focus on developing problem-solving skills, analytical thinking, and communication abilities. As you progress through your B.Tech. program, you'll have the opportunity to specialize in a particular area of engineering and take more advanced courses in your chosen field.\n\nI hope this information helps! Let me know if you have any further questions."
  },
  {
    "type": "human",
    "human": "I would like to know the courses run in your college"
  },
  {
    "type": "ai",
    "ai": "I'd be happy to help you with that! The Faculty of Engineering at our college offers a range of courses for the B.Tech program in its first year, which is common to all courses. \n\nIn the first year, students typically take a set of core courses that provide a solid foundation in engineering principles and practices. These courses are designed to introduce students to the fundamental concepts and theories of engineering, as well as to develop their problem-solving skills and critical thinking abilities. \n\nSome of the typical courses that are part of the first-year curriculum for B.Tech students at our college include mathematics, physics, chemistry, computer programming, and engineering graphics. These courses are designed to provide students with a broad-based education that prepares them for further studies in their chosen field of engineering. \n\nIn addition to these core courses, students may also have the option to take elective courses that allow them to explore specific areas of interest or to gain practical experience in their chosen field. These elective courses can provide students with valuable hands-on experience and help them to develop their skills and knowledge in a specific area of engineering. \n\nOverall, the first year of the B.Tech program at our college is designed to provide students with a solid foundation in engineering principles and practices, as well as to introduce them to the various disciplines and specializations within the field of engineering."
  },
  {
    "type": "human",
    "human": "hey"
  },
  {
    "type": "ai",
    "ai": "Hey! It's great to chat with you! I noticed that you're interested in something related to Shark Tank-style competitions and student events. Am I right?"
  },
  {
    "type": "human",
    "human": "I would like to know the courses run in your college"
  },
  {
    "type": "ai",
    "ai": "I'd be happy to help you with that! The B.Tech program at the Faculty of Engineering has a common curriculum for the first year, which includes both Semester I and Semester II. The courses are designed to provide a solid foundation in engineering principles and practices. Some of the common courses that are typically offered during the first year include:\n\n* Mathematics: Calculus, Linear Algebra, and Probability and Statistics\n* Physics: Mechanics, Electricity, and Electronics\n* Chemistry: Inorganic and Organic Chemistry\n* Computer Programming: Programming languages such as C, C++, and Python\n* Engineering Graphics: Introduction to CAD and drafting\n* English Communication: Fundamentals of communication and presentation skills\n\nThese courses are essential for building a strong foundation in engineering and are common to all B.Tech programs. However, please note that the specific courses and curriculum may vary depending on the institution and the program."
  },
  {
    "type": "human",
    "human": "hey"
  },
  {
    "type": "ai",
    "ai": "Hello! It's great to chat with you. How can I help today?"
  },
  {
    "type": "human",
    "human": "hi"
  },
  {
    "type": "ai",
    "ai": "Hello! It's great to chat with you. How can I help you today?"
  },
  {
    "type": "human",
    "human": "Can you tell me about Jecrc university situated in Jaipur"
  },
  {
    "type": "ai",
    "ai": "JECRC University is a prestigious institution located in Jaipur, the capital city of Rajasthan, India. The university has a 32-acre campus that combines unique classical architecture with thoughtful layout and landscaping, creating a perfect learning ecosystem. The campus is situated in the prime industrial and institutional hub of Jaipur, making it well-connected to all parts of the city.\n\nJECRC University is driven by a culture of excellence, research, and innovation. The university's research focuses on multifaceted exploration, encompassing subject-specific research as well as the contexts of the business environment in which students will operate and perform. With a strong research culture and close industry linkages, JECRC University is known for its innovative approach to education.\n\nThe university has a rich history, having completed two decades of academic excellence. With over 4000 students on campus, JECRC University offers a diverse range of academic programs, providing students with a comprehensive education and preparing them for successful careers."
  },
  {
    "type": "human",
    "human": "Can you tell me about Jecrc university situated in Jaipur"
  },
  {
    "type": "ai",
    "ai": "JECRC University is a renowned institution located in Jaipur, the capital city of Rajasthan, India. The university has a 32-acre campus that combines unique classical architecture and thoughtful layout and landscaping to create a perfect learning ecosystem. With a strong research culture and close industry linkages, JECRC University is driven by the spirit of innovation-led research. The university has a diverse student body of over 4000 students and has been a part of the academic landscape for over two decades."
  },
  {
    "type": "human",
    "human": "Are you provide BCA course as well in Jecrc?"
  },
  {
    "type": "ai",
    "ai": "Yes, JECRC offers the BCA (Bachelor of Computer Applications) course, as shown on page 48 of their 2025 brochure. The course has three years of duration and offers industry specializations."
  },
  {
    "type": "human",
    "human": "can you give me details of BCA course ?"
  },
  {
    "type": "ai",
    "ai": "Here are the details of the BCA course:\n\n**Eligibility:** Minimum 60% Marks in 10+2 examination from CBSE or equivalent with pass in English.\n\n**Courses:** BCA MERN Full Stack, BCA Robotic Process Automation, BCA Digital Forensics & Information Security, BCA Game Development.\n\n**Duration:** 3 years.\n\n**Fees:** The fees structure is as follows:\n\t* Tuition Fee: 102500 (BCA MERN Full Stack)\n\t* Other Fee: 67500\n\t* Total: 170000\n\t* Annual Fee: 95000\n\nPlease note that these fees are subject to change, and you should verify the details with the college or institution before applying."
  },
  {
    "type": "human",
    "human": "5 Favorite Ways to Spend Your Evenings at the University"
  },
  {
    "type": "ai",
    "ai": "Here are 5 wonderful ways to spend your evenings at the JECRC Campus: Take a calm walk around the campus, grab your earphones, and enjoy the peaceful atmosphere. Visit the cafeteria for a quick evening snack, featuring noodles, sandwiches, and coffee. Relax under a canopy with a book and the soothing sounds of nature. Play football or cricket on the central lawn with friends. And, discover the hidden gem - a temple behind the Engineering block, perfect for focusing, relaxing, or playing badminton."
  },
  {
    "type": "human",
    "human": "Managing Stress, Anxiety and Mental Health at University"
  },
  {
    "type": "ai",
    "ai": "Managing stress, anxiety, and mental health is crucial for students at JECRC University. The university provides various resources to support students' well-being. These include a 24-hour ambulance service, a dispensary with hours from 8:00 am to 6:00 pm, and arrangements for medical facilities. Additionally, the university offers counseling services to help students manage stress and anxiety. It's essential for students to prioritize their mental health and seek help when needed."
  },
  {
    "type": "human",
    "human": "What are stress and anxiety?"
  },
  {
    "type": "ai",
    "ai": "Stress and anxiety are two common emotional states that can affect individuals. Stress is a normal response to a perceived threat or challenge, and it can trigger a fight-or-flight response in the body. This response is designed to help us react quickly to danger, but when it becomes chronic, it can lead to physical and emotional exhaustion.\n\nAnxiety, on the other hand, is a feeling of worry, nervousness, or fear that is often disproportionate to the situation. It can be a persistent and overwhelming feeling that interferes with daily life. Both stress and anxiety can have negative impacts on mental and physical health, relationships, and overall well-being."
  },
  {
    "type": "human",
    "human": "Adapting From School Life to University Life"
  },
  {
    "type": "ai",
    "ai": "Adapting from school life to university life can be a significant transition. To make this transition smoother, it's essential to choose a university that offers a supportive environment, state-of-the-art infrastructure, and a faculty that is committed to student development. At JECRC University, we understand the importance of this transition and strive to provide a holistic learning experience that prepares students for their future careers. Our faculty consists of a mix of academic and professional staff, including entrepreneurs, consultants, and business leaders, which provides students with a unique perspective on the business world. Additionally, our university's international perspective offers excellent practice for the global economic environment, making our graduates more attractive to employers. By choosing JECRC University, students can gain a truly holistic perspective of the business world and set themselves up for success in their future careers."
  }
]